modules/post/views/post/_form.php


    <?= $form->field($model, 'section')->hiddenInput(['value' => $section])->label(false); ?>

    <?= $form->field($model, 'key_post')->dropDownList(ArrayHelper::map(Template::find()->all(), 'name', 'name')) ?>
---
SELECT * FROM `template`