modules/eiee/controllers/AcademicController.php

    public function actionIndex($section = NULL)
    {
        if ($section == NULL){
            return $this->goHome();
        };
        $desc = Profile::find()->where(['key_profile' => $section])->One();
---
SELECT * FROM `profile` WHERE `key_profile`='academic'