modules/post/controllers/PageController.php

SELECT * FROM `post` WHERE `section`='Section'
---
    protected function getQuery($section)
    {
        $query = Post::find()->andWhere(['section' => $section])->asArray()->all();