modules/post/controllers/PostController.php

    public function actionCreate($section = NULL)
    {
        if (!Yii::$app->user->can($section)) {
            return $this->goHome();
        }
        //$model = new Post();
        $model = new Post();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `post` (`name`, `section`, `key_post`, `value_post`, `status`, `rule`, `tag`, `updatedAt`) VALUES ('Section', 'Section', 'Заголовок', 'kkkkkkkkkkkkkkkkkkkkkk', 0, '1', '1', '2020-01-09 04:10:28')